export default { 
     '/':[{
        text: '默認配置-强大功能 👀',link: '/zh-HK/默认配置',
        items: [
          { text: '⭐-支持Vial實時改鍵', link: '',
            items:[
              { }
            ]},
          { text: '🔢-三種連接模式', link: '',
            items:[
              { }
            ] },
          { text: '🔋-大容量電池轉換模式', link: '',
            items:[
              { }
            ] }
        ]
      },{
        text: '基礎訂製-膽芯與結構 👀',link: '/zh-HK/基础定制/键盘内胆',
        items: [
          { text: '', 
            items:[
              { text: '799', 
            items:[
              {  }
            ] }
            ]
          },
          { text: '1️⃣-排列選擇 👀',link: '/zh-HK/基础定制/配列选择',
            collapsed:true,    /*下拉菜单*/ 
            items:[
              { text: '⌨默認排列 ',link: '/zh-HK/基础定制/配列选择/默认配列',  },
              { text: '⌨自製排列 ',link: '/zh-HK/基础定制/配列选择/自定义配列',  }
            ] 
          },
          { text: '2️⃣-軸體類型 👀',link: '/zh-HK/基础定制/轴体选择',
            collapsed:true,   /*下拉菜单*/ 
            items:[
              { text: '⌨高軸 ',link: '/zh-HK/基础定制/轴体选择/高轴',  },
              { text: '⌨矮軸 ',link: '/zh-HK/基础定制/轴体选择/矮轴',  }
            ] 
          },
          { text: '3️⃣-PCB-A焊接選擇 👀', link: '/zh-HK/基础定制/PCB焊接',
            items:[
              { }
            ]
           },
          { text: '4️⃣-定位板選擇 👀', link: '/zh-HK/基础定制/定位板选择',
            items:[
              { }
            ] },
          { text: '5️⃣-消音套件 👀', link: '/zh-HK/基础定制/声音包',
            items:[
              { }
            ] }
        ]
      },{
            text: '基礎訂製-外殼 👀', link: '/zh-HK/基础定制/基础外壳',
            items:[
          { text: '', 
            items:[
              { text: '499',
            items:[
              {  }
            ] }
            ]
          },
              { text: '🎨-姓名、LOGO訂製 👀', link: '/zh-HK/基础定制/姓名定制',
            items:[
              { }
            ] }
            ] 
        
      },{
        text: '高級訂製-全方位 👀',link: '/zh-HK/深度定制/全方位定制',
        items: [
          { text: '', 
            items:[
              { text: '1699', 
            items:[
              {  }
            ] }
            ]
          },
          { text: '1️⃣-滿配内部填充 👀', link: '/zh-HK/深度定制/满配声音包',
            items:[
              { }
            ]},
          { text: '2️⃣-鍵盤結構重塑 👀', link: '/zh-HK/深度定制/键盘结构',
            items:[
              { }
            ]},
          { text: '3️⃣-全新外殼設計 👀', link: '/zh-HK/深度定制/外壳定制',
            items:[
              {  }
            ] }
        ]
      },


    ],




}

