export default { 
     '/docs/':[{
        text: '默认配置-强大功能 👀',link: '/docs/基础定制/默认配置/Vial',
        items: [
          { text: '⭐-支持Vial实时改键', link: '',
            items:[
              { }
            ]},
          { text: '🔢-三种连接模式', link: '',
            items:[
              { }
            ] },
          { text: '🔋-大容量电池转换模块', link: '',
            items:[
              { }
            ] }
        ]
      },{
        text: '基础定制-内胆 👀',link: '/docs/基础定制/键盘内胆',
        items: [
          { text: '', 
            items:[
              { text: '799', 
            items:[
              {  }
            ] }
            ]
          },
          { text: '1️⃣-配列选择 👀',link: '/docs/基础定制/配列选择',
            collapsed:true,    /*下拉菜单*/ 
            items:[
              { text: '⌨自定义配列 ',link: '/docs/基础定制/配列选择/自定义配列',  },
              { text: '⌨参考配列 ',link: '/docs/基础定制/配列选择/默认配列',  }
            ] 
          },
          { text: '2️⃣-轴体选择 👀',link: '/docs/基础定制/轴体选择',
            collapsed:true,   /*下拉菜单*/ 
            items:[
              { text: '⌨常规轴 ',link: '/docs/基础定制/轴体选择/常规轴',  },
              { text: '⌨矮轴 ',link: '/docs/基础定制/轴体选择/矮轴',  }
            ] 
          },
          { text: '3️⃣-PCB焊接选择 👀', link: '/docs/基础定制/PCB焊接',
            items:[
              { }
            ]
           },
          { text: '4️⃣-定位板选择 👀', link: '/docs/基础定制/定位板选择',
            items:[
              { }
            ] },
          { text: '5️⃣-声音套件 👀', link: '/docs/基础定制/声音包',
            items:[
              { }
            ] }
        ]
      },{
            text: '基础定制-外壳 👀', link: '/docs/基础定制/基础外壳',
            items:[
          { text: '', 
            items:[
              { text: '499',
            items:[
              {  }
            ] }
            ]
          },
              { text: '🎨-姓名、LOGO定制 👀', link: '/docs/基础定制/姓名定制',
            items:[
              { }
            ] }
            ] 
        
      },{
        text: '深度定制-全方位 👀',link: '/docs/深度定制/全方位定制',
        items: [
          { text: '', 
            items:[
              { text: '1699', 
            items:[
              {  }
            ] }
            ]
          },
          { text: '1️⃣-满配内部填充 👀', link: '/docs/深度定制/满配声音包',
            items:[
              { }
            ]},
          { text: '2️⃣-键盘结构重塑 👀', link: '/docs/深度定制/键盘结构',
            items:[
              { }
            ]},
          { text: '3️⃣-全新外壳设计 👀', link: '/docs/深度定制/外壳定制',
            items:[
              {  }
            ] }
        ]
      },


    ],




}

